tykhaytschaar/hannamp3/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash: 16 MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 8 MB Octal (N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# CPU 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# FreeRTOS 1 kHz tick (smoother LVGL)
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Main stack — bőven az LVGL widget építéshez + sd_scan-hez
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Stack overflow detection — ha valami túlnő, FreeRTOS panic helyett
# konkrét hibaüzenetet kapunk a task nevével.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# A fizikai gombok callbackjei az esp_timer taskban futnak, és FATFS+LVGL
# munkát végeznek (browser_activate) — a default 3584 kevés.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192

# Console az UART0-ra (a dev kit "COMM"/"UART" portjára).
# Ha natív USB-ről akarsz monitorozni, kapcsold ezt USB_SERIAL_JTAG-re.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# FATFS for SD
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_852=y

# LVGL
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_CUSTOM=y
# Az egyedi fontok (mp3_inter_*) tömörített glyph-bitmappel készültek (bpp=4),
# ehhez kell a font-dekompresszió, különben minden betű üres téglalap.
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_FS_POSIX_PATH=""
CONFIG_LV_USE_SJPG=y
CONFIG_LV_USE_TJPGD=y
CONFIG_LV_TICK_CUSTOM=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y

# USB MSC mód: az SD kártya kitevése a natív USB-n (GPIO19/20) külső
# meghajtóként. A Settings-ből indítható reboot-tal (lásd usb_msc.c).
# A buffer 8192 (16 szektor/olvasás): a macOS (FSKit) msdos mount ~20s alatt
# beolvassa a FAT-táblát; 512-vel (egy-szektoros olvasás) ez túllépi a 20s
# timeoutot → "FATManager failed to init". Multi-block olvasással belefér.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=8192
